echostreams/nucemu/hw/usb/nuc970-usbd.c
#include "qemu/osdep.h"
#include "hw/sysbus.h"
#include "hw/register.h"
#include "qemu/bitops.h"
#include "qemu/log.h"
#include "qapi/error.h"
#include "hw/irq.h"
#include "qemu/main-loop.h" /* iothread mutex */
#include "sysemu/dma.h"

#include "usbip.h"
#include "nuc970-usbd.h"
#include "usbip_server.h"

typedef struct {

    union {
        uint32_t EPDAT;
        uint8_t  EPDAT_BYTE;

    } ep;
    uint32_t EPINTSTS;
    uint32_t EPINTEN;
    uint32_t EPDATCNT;
    uint32_t EPRSPCTL;
    uint32_t EPMPS;
    uint32_t EPTXCNT;
    uint32_t EPCFG;
    uint32_t EPBUFSTART;
    uint32_t EPBUFEND;
    uint8_t buf[512];
    uint32_t buf_level;
} USBD_EP_T;

typedef struct {
    SysBusDevice parent_obj;
    MemoryRegion iomem;
    qemu_irq irq;
    usbip_cfg_t usbip_cfg;
    QemuThread usbip_thread;
    QemuMutex usbip_mutex;
    QemuCond usbip_cond;
    QemuCond usip_reply_ready;

    QemuMutex usbip_rx_mtx;
    uint8_t usbip_rx_buffer[4096];
    uint32_t usbip_rx_level;
    uint32_t usbip_rx_index;

    QemuMutex usbip_tx_mtx;
    uint8_t usbip_tx_buffer[4096];
    uint32_t usbip_tx_level;
    uint32_t usbip_tx_index;

    uint8_t usbip_cep_buffer[512];  // control endpoint buffer
    uint32_t usbip_cep_level;
    uint32_t usbip_cep_index;

    uint32_t GINTSTS;
    uint32_t RESERVE0[1];
    uint32_t GINTEN;
    uint32_t RESERVE1[1];
    uint32_t BUSINTSTS;
    uint32_t BUSINTEN;
    uint32_t OPER;
    uint32_t FRAMECNT;
    uint32_t FADDR;
    uint32_t TEST;
    union {
        uint32_t CEPDAT;
        uint8_t  CEPDAT_BYTE;
    } cep;
    uint32_t CEPCTL;
    uint32_t CEPINTEN;
    uint32_t CEPINTSTS;
    uint32_t CEPTXCNT;
    uint32_t CEPRXCNT;
    uint32_t CEPDATCNT;
    uint32_t SETUP1_0;
    uint32_t SETUP3_2;
    uint32_t SETUP5_4;
    uint32_t SETUP7_6;
    uint32_t CEPBUFSTART;
    uint32_t CEPBUFEND;
    uint32_t DMACTL;
    uint32_t DMACNT;
    USBD_EP_T EP[12];
    uint32_t RESERVE2[303];
    uint32_t DMAADDR;
    uint32_t PHYCTL;

} USBD_T;

#define TYPE_NUC970_USBD "nuc970-usbd"
#define NUC970_USBD(obj) \
        OBJECT_CHECK(USBD_T, (obj), TYPE_NUC970_USBD)

#define USBIP
#ifdef USBIP

/* USB Descriptor Type */
#define DESC_DEVICE         0x01
#define DESC_CONFIG         0x02
#define DESC_STRING         0x03
#define DESC_INTERFACE      0x04
#define DESC_ENDPOINT       0x05
#define DESC_QUALIFIER      0x06
#define DESC_OTHERSPEED     0x07
#define DESC_IFPOWER        0x08
#define DESC_OTG            0x09

/* USB Descriptor Length */
#define LEN_DEVICE          18
#define LEN_QUALIFIER       10
#define LEN_CONFIG          9
#define LEN_INTERFACE       9
#define LEN_ENDPOINT        7
#define LEN_OTG             5
#define LEN_HID             9

/* USB Endpoint Type */
#define EP_ISO              0x01
#define EP_BULK             0x02
#define EP_INT              0x03

#define EP_INPUT            0x80
#define EP_OUTPUT           0x00

/* Device Descriptor */
const USB_DEVICE_DESCRIPTOR _dev_dsc =
{
    /*
    0x12,                   // Size of this descriptor in bytes
    0x01,                   // DEVICE descriptor type
    0x0200,                 // USB Spec Release Number in BCD format
    0x00,                   // Class Code
    0x00,                   // Subclass code
    0x00,                   // Protocol code
    0x40,                   // Max packet size for EP0, see usb_config.h
    0x0416,                 // Vendor ID
    0x5963,                 // Product ID
    0x0100,                 // Device release number in BCD format
    0x01,                   // Manufacturer string index
    0x02,                   // Product string index
    0x00,                   // Device serial number string index
    0x01                    // Number of possible configurations
    */
    LEN_DEVICE,     /* bLength */
    DESC_DEVICE,    /* bDescriptorType */
    0x200,          /* bcdUSB */
    0x00,           /* bDeviceClass */
    0x00,           /* bDeviceSubClass */
    0x00,           /* bDeviceProtocol */
    0x40,           /* bMaxPacketSize0 */
    /* idVendor */
    0x0416,
    /* idProduct */
    0x0970,
    0x000,          /* bcdDevice */
    0x01,           /* iManufacture */
    0x02,           /* iProduct */
    0x00,           /* iSerialNumber - no serial */
    0x01            /* bNumConfigurations */
};

const USB_DEVICE_QUALIFIER_DESCRIPTOR _dev_qua = {
    0x0A,       // bLength
    0x06,       // bDescriptorType
    0x0200,     // bcdUSB
    0x00,       // bDeviceClass
    0x00,       // bDeviceSubClass
    0x00,       // bDeviceProtocol
    0x40,       // bMaxPacketSize
    0x01,       // iSerialNumber
    0x00        //bNumConfigurations*/
};

//Configuration
typedef struct __attribute__((__packed__)) _CONFIG_MSC
{
    USB_CONFIGURATION_DESCRIPTOR dev_conf0;
    USB_INTERFACE_DESCRIPTOR dev_int0;
    USB_ENDPOINT_DESCRIPTOR dev_ep0;
    USB_ENDPOINT_DESCRIPTOR dev_ep1;
} CONFIG_MSC;

const CONFIG_MSC  configuration_msc = {
    {
        /* Configuration Descriptor */
        0x09,//sizeof(USB_CFG_DSC),    // Size of this descriptor in bytes
        USB_DESCRIPTOR_CONFIGURATION,                // CONFIGURATION descriptor type
        0x0020, //sizeof(CONFIG_CDC),                // Total length of data for this cfg
        1,                      // Number of interfaces in this cfg
        1,                      // Index value of this configuration
        0,                      // Configuration string index
        0xC0,
        50,                     // Max power consumption (2X mA)
    },
    {
        /* Interface Descriptor */
        0x09,//sizeof(USB_INTF_DSC),   // Size of this descriptor in bytes
        USB_DESCRIPTOR_INTERFACE,               // INTERFACE descriptor type
        0,                      // Interface Number
        0,                      // Alternate Setting Number
        2,                      // Number of endpoints in this intf
        0,                      // Class code
        0,                      // Subclass code
        0,                      // Protocol code
        0                       // Interface string index
    },
    {
        /* Endpoint Descriptor */
        0x07,/*sizeof(USB_EP_DSC)*/
        USB_DESCRIPTOR_ENDPOINT,    //Endpoint Descriptor
        0x81,                       //EndpointAddress
        0x02,                       //Attributes
        0x0200,                     //size
        0x01                        //Interval
    },
    {
        /* Endpoint Descriptor */
        0x07,/*sizeof(USB_EP_DSC)*/
        USB_DESCRIPTOR_ENDPOINT,    //Endpoint Descriptor
        0x02,                       //EndpointAddress
        0x02,                       //Attributes
        0x0200,                     //size
        0x01                        //Interval
    }
};

const unsigned char _string_0[] = { // available languages descriptor
                0x04,
                USB_DESCRIPTOR_STRING,
                0x09,
                0x04
};

const unsigned char _string_1[] = { //
                0x16,
                USB_DESCRIPTOR_STRING, // bLength, bDscType
                'U', 0x00, //
                'S', 0x00, //
                'B', 0x00, //
                ' ', 0x00, //
                'D', 0x00, //
                'e', 0x00, //
                'v', 0x00, //
                'i', 0x00, //
                'c', 0x00, //
                'e', 0x00, //
};

