echostreams/nucemu/hw/usb/nuc970-usbd.c
const unsigned char _string_2[] = { //
                0x34,
                USB_DESCRIPTOR_STRING, //
                'N', 0x00, //
                'u', 0x00, //
                'v', 0x00, //
                'o', 0x00, //
                't', 0x00, //
                'o', 0x00, //
                'n', 0x00, //
                ' ', 0x00, //
                'A', 0x00, //
                'R', 0x00, //
                'M', 0x00, //
                ' ', 0x00, //
                '9', 0x00, //
                '2', 0x00, //
                '6', 0x00, //
                '-', 0x00, //
                'B', 0x00, //
                'a', 0x00, //
                's', 0x00, //
                'e', 0x00, //
                'd', 0x00, //
                ' ', 0x00, //
                'M', 0x00, //
                'C', 0x00, //
                'U', 0x00, //
};


const char* _configuration = (const char*)&configuration_msc;

const USB_INTERFACE_DESCRIPTOR* _interfaces[] = { &configuration_msc.dev_int0 };

const unsigned char* _strings[] = { _string_0, _string_1, _string_2 };

static void set_rx_level(USBD_T* usbd, uint32_t level)
{
    qemu_mutex_lock(&usbd->usbip_rx_mtx);
    usbd->usbip_rx_level = level;
    qemu_mutex_unlock(&usbd->usbip_rx_mtx);
}

static uint32_t get_rx_level(USBD_T* usbd)
{
    uint32_t ret;
    qemu_mutex_lock(&usbd->usbip_rx_mtx);
    ret = usbd->usbip_rx_level;
    qemu_mutex_unlock(&usbd->usbip_rx_mtx);
    return ret;
}

static void set_tx_level(USBD_T* usbd, uint32_t level)
{
    qemu_mutex_lock(&usbd->usbip_tx_mtx);
    usbd->usbip_tx_level = level;
    qemu_mutex_unlock(&usbd->usbip_tx_mtx);
}

static uint32_t get_tx_level(USBD_T* usbd)
{
    uint32_t ret;
    qemu_mutex_lock(&usbd->usbip_tx_mtx);
    ret = usbd->usbip_tx_level;
    qemu_mutex_unlock(&usbd->usbip_tx_mtx);
    return ret;
}

void handle_device_list(const USB_DEVICE_DESCRIPTOR* dev_dsc, OP_REP_DEVLIST* list)
{
    CONFIG_GEN* conf = (CONFIG_GEN*)_configuration;
    int i;
    list->header.version = htons(273);
    list->header.command = htons(5);
    list->header.status = 0;
    list->header.nExportedDevice = htonl(1);
    memset(list->device.usbPath, 0, 256);
    strcpy(list->device.usbPath, "/sys/devices/pci0000:00/0000:00:01.2/usb1/1-1");
    memset(list->device.busID, 0, 32);
    strcpy(list->device.busID, "1-1");
    list->device.busnum = htonl(1);
    list->device.devnum = htonl(2);
    list->device.speed = htonl(2);
    list->device.idVendor = htons(dev_dsc->idVendor);
    list->device.idProduct = htons(dev_dsc->idProduct);
    list->device.bcdDevice = htons(dev_dsc->bcdDevice);
    list->device.bDeviceClass = dev_dsc->bDeviceClass;
    list->device.bDeviceSubClass = dev_dsc->bDeviceSubClass;
    list->device.bDeviceProtocol = dev_dsc->bDeviceProtocol;
    list->device.bConfigurationValue = conf->dev_conf.bConfigurationValue;
    list->device.bNumConfigurations = dev_dsc->bNumConfigurations;
    list->device.bNumInterfaces = conf->dev_conf.bNumInterfaces;
    list->interfaces = malloc(list->device.bNumInterfaces * sizeof(OP_REP_DEVLIST_INTERFACE));
    for (i = 0; i < list->device.bNumInterfaces; i++)
    {
        list->interfaces[i].bInterfaceClass = _interfaces[i]->bInterfaceClass;
        list->interfaces[i].bInterfaceSubClass = _interfaces[i]->bInterfaceSubClass;
        list->interfaces[i].bInterfaceProtocol = _interfaces[i]->bInterfaceProtocol;
        list->interfaces[i].padding = 0;
    }
};

static void nuc970_usbd_update_interrupt(USBD_T*);
static void usbd_handle_attach(const USB_DEVICE_DESCRIPTOR* _dev_dsc, OP_REP_IMPORT* rep, USBD_T *s)
{
    //CONFIG_GEN* conf = (CONFIG_GEN*)_configuration;

    USB_DEVICE_DESCRIPTOR local_dsc;
    uint64_t setup = 0x8006000100004000;
    {
        s->SETUP1_0 = ntohs((setup & 0xFFFF000000000000) >> 48);
        s->SETUP3_2 = ntohs((setup & 0x0000FFFF00000000) >> 32);
        s->SETUP5_4 = ntohs((setup & 0x00000000FFFF0000) >> 16);
        s->SETUP7_6 = ntohs((setup & 0x000000000000FFFF) >> 0);
        s->CEPINTSTS |= USBD_CEPINTSTS_SETUPPKIF_Msk;
        qemu_mutex_lock_iothread();
        nuc970_usbd_update_interrupt(s);
        qemu_mutex_unlock_iothread();
    }

    g_usleep(G_USEC_PER_SEC * 0.5);
    
    s->CEPINTSTS |= USBD_CEPINTSTS_INTKIF_Msk;
    qemu_mutex_lock_iothread();
        nuc970_usbd_update_interrupt(s);
        qemu_mutex_unlock_iothread();

        qemu_mutex_lock(&s->usbip_tx_mtx);
        

        // if (reply_required) 
        // {
        qemu_cond_wait(&s->usip_reply_ready, &s->usbip_tx_mtx);
        // }
        printf(" reply ready...\n");
        //header.raw = s->usbip_tx_buffer[0];
        //usbip_send_reply(&s->usbip_cfg, usb_req, (char*)&s->usbip_tx_buffer[0],
        //    //header.DEV.BCNT,
        //    s->CEPTXCNT,
        //    0);
        // Wipe data from buffer.
        s->usbip_cep_level = 0;
        qemu_mutex_unlock(&s->usbip_tx_mtx);

        s->CEPINTSTS |= USBD_CEPINTSTS_TXPKIF_Msk;
        qemu_mutex_lock_iothread();
        nuc970_usbd_update_interrupt(s);
        qemu_mutex_unlock_iothread();
        usleep(1000);
        memcpy(&local_dsc, &s->usbip_cep_buffer[0], s->CEPTXCNT);
    
    
    for (int i = 0; i < s->CEPTXCNT; i++)
    {
        printf("  %02x", ((uint8_t*)&local_dsc)[i]);
    }
    printf("\n");

    s->CEPINTSTS |= USBD_CEPINTSTS_STSDONEIF_Msk;
    qemu_mutex_lock_iothread();
    nuc970_usbd_update_interrupt(s);
    qemu_mutex_unlock_iothread();
    usleep(1000);

    // get configuration
    USB_CONFIGURATION_DESCRIPTOR local_config;
    setup = 0x8006000200000900;
    {
        s->SETUP1_0 = ntohs((setup & 0xFFFF000000000000) >> 48);
        s->SETUP3_2 = ntohs((setup & 0x0000FFFF00000000) >> 32);
        s->SETUP5_4 = ntohs((setup & 0x00000000FFFF0000) >> 16);
        s->SETUP7_6 = ntohs((setup & 0x000000000000FFFF) >> 0);
        s->CEPINTSTS |= USBD_CEPINTSTS_SETUPPKIF_Msk;
        qemu_mutex_lock_iothread();
        nuc970_usbd_update_interrupt(s);
        qemu_mutex_unlock_iothread();
    }

    g_usleep(G_USEC_PER_SEC * 0.5);

