echostreams/nucemu/hw/usb/nuc970-usbd.c
    s->CEPINTSTS |= USBD_CEPINTSTS_INTKIF_Msk;
    qemu_mutex_lock_iothread();
    nuc970_usbd_update_interrupt(s);
    qemu_mutex_unlock_iothread();

    qemu_mutex_lock(&s->usbip_tx_mtx);


    // if (reply_required) 
    // {
    qemu_cond_wait(&s->usip_reply_ready, &s->usbip_tx_mtx);
    // }
    printf(" reply ready...\n");
    //header.raw = s->usbip_tx_buffer[0];
    //usbip_send_reply(&s->usbip_cfg, usb_req, (char*)&s->usbip_tx_buffer[0],
    //    //header.DEV.BCNT,
    //    s->CEPTXCNT,
    //    0);
    // Wipe data from buffer.
    s->usbip_cep_level = 0;
    qemu_mutex_unlock(&s->usbip_tx_mtx);

    s->CEPINTSTS |= USBD_CEPINTSTS_TXPKIF_Msk;
    qemu_mutex_lock_iothread();
    nuc970_usbd_update_interrupt(s);
    qemu_mutex_unlock_iothread();
    usleep(1000);
    memcpy(&local_config, &s->usbip_cep_buffer[0], s->CEPTXCNT);

    for (int i = 0; i < s->CEPTXCNT; i++)
    {
        printf("  %02x", ((uint8_t*)&local_config)[i]);
    }
    printf("\n");

    s->CEPINTSTS |= USBD_CEPINTSTS_STSDONEIF_Msk;
    qemu_mutex_lock_iothread();
    nuc970_usbd_update_interrupt(s);
    qemu_mutex_unlock_iothread();
    usleep(1000);

    rep->version = htons(273);
    rep->command = htons(3);
    rep->status = 0;
    memset(rep->usbPath, 0, 256);
    strcpy(rep->usbPath, "/sys/devices/pci0000:00/0000:00:01.2/usb1/1-1");
    memset(rep->busID, 0, 32);
    strcpy(rep->busID, "1-1");
    rep->busnum = htonl(1);
    rep->devnum = htonl(2);
    rep->speed = htonl(2);
    rep->idVendor = local_dsc.idVendor;
    rep->idProduct = local_dsc.idProduct;
    rep->bcdDevice = local_dsc.bcdDevice;
    rep->bDeviceClass = local_dsc.bDeviceClass;
    rep->bDeviceSubClass = local_dsc.bDeviceSubClass;
    rep->bDeviceProtocol = local_dsc.bDeviceProtocol;
    rep->bNumConfigurations = local_dsc.bNumConfigurations;
    rep->bConfigurationValue = local_config.bConfigurationValue;// conf->dev_conf.bConfigurationValue;
    rep->bNumInterfaces = local_config.bNumInterfaces;// conf->dev_conf.bNumInterfaces;
}

void pack(int* data, int size)
{
    int i;
    size = size / 4;
    for (i = 0; i < size; i++)
    {
        data[i] = htonl(data[i]);
    }
    //swap setup
    i = data[size - 1];
    data[size - 1] = data[size - 2];
    data[size - 2] = i;
}

void unpack(int* data, int size)
{
    int i;
    size = size / 4;
    for (i = 0; i < size; i++)
    {
        data[i] = ntohl(data[i]);
    }
    //swap setup
    i = data[size - 1];
    data[size - 1] = data[size - 2];
    data[size - 2] = i;
}


void send_usb_req(int sockfd, USBIP_RET_SUBMIT* usb_req, char* data, unsigned int size, unsigned int status)
{
    usb_req->command = 0x3;
    usb_req->status = status;
    usb_req->actual_length = size;
    usb_req->start_frame = 0x0;
    usb_req->number_of_packets = 0x0;

    usb_req->setup = 0x0;
    usb_req->devid = 0x0;
    usb_req->direction = 0x0;
    usb_req->ep = 0x0;

    pack((int*)usb_req, sizeof(USBIP_RET_SUBMIT));

    if (send(sockfd, (char*)usb_req, sizeof(USBIP_RET_SUBMIT), 0) != sizeof(USBIP_RET_SUBMIT))
    {
        printf("send error : %s \n", strerror(errno));
        exit(-1);
    };

    if (size > 0)
    {
        if (send(sockfd, data, size, 0) != size)
        {
            printf("send error : %s \n", strerror(errno));
            exit(-1);
        };
        printf("\033[0;32m");
        for (int i = 0; i < size; i++) {
            printf(" %02x", ((unsigned char*)data)[i]);
            if ((i + 1) % 16 == 0)
                printf("\n");
        }
        printf("\n\033[0m");
    }
}

int handle_get_descriptor(int sockfd, StandardDeviceRequest* control_req, USBIP_RET_SUBMIT* usb_req)
{
    int handled = 0;
    printf("handle_get_descriptor %u [%u]\n", control_req->wValue1, control_req->wValue0);
    if (control_req->wValue1 == 0x1) // Device
    {
        printf("Device\n");
        handled = 1;
        send_usb_req(sockfd, usb_req, (char*)&_dev_dsc, sizeof(USB_DEVICE_DESCRIPTOR)/*control_req->wLength*/, 0);
    }
    if (control_req->wValue1 == 0x2) // configuration
    {
        printf("Configuration\n");
        handled = 1;
        send_usb_req(sockfd, usb_req, (char*)_configuration, control_req->wLength, 0);
    }
    if (control_req->wValue1 == 0x3) // string
    {
        char str[255];
        int i;
        memset(str, 0, 255);
        for (i = 0; i < (*_strings[control_req->wValue0] / 2) - 1; i++)
            str[i] = _strings[control_req->wValue0][i * 2 + 2];
        printf("String (%s)\n", str);
        handled = 1;
        send_usb_req(sockfd, usb_req, (char*)_strings[control_req->wValue0], *_strings[control_req->wValue0], 0);
    }
    if (control_req->wValue1 == 0x6) // qualifier
    {
        printf("Qualifier\n");
        handled = 1;
        send_usb_req(sockfd, usb_req, (char*)&_dev_qua, control_req->wLength, 0);
    }
    if (control_req->wValue1 == 0xA) // config status ???
    {
        printf("Unknow\n");
        handled = 1;
        send_usb_req(sockfd, usb_req, "", 0, 1);
    }
    return handled;
}

int handle_set_configuration(int sockfd, StandardDeviceRequest* control_req, USBIP_RET_SUBMIT* usb_req)
{
    int handled = 0;
    printf("handle_set_configuration %u[%u]\n", control_req->wValue1, control_req->wValue0);
    handled = 1;
    send_usb_req(sockfd, usb_req, "", 0, 0);
    return handled;
}

#define BSIZE 4096
unsigned char usbd_buffer[BSIZE + 1];
int bsize = 0;

void hex_dump(unsigned char* buf, int size)
{
    int i;
    for (i = 0; i < size; i++) {
        printf("%02X ", buf[i]);
        if ((i + 1) % 16 == 0)
            printf("\n");
    }
    printf("\n");
}

void handle_data(int sockfd, USBIP_RET_SUBMIT* usb_req, int bl, USBD_T *usbd)
{
    printf(">> Data EP: %d, len: %d\n", usb_req->ep, bl);
    int ack;
    if (usb_req->ep == 0x01)
    {
        printf("EP1 received \n");

        if (usb_req->direction == 0) //input
        {
            printf("direction=input\n");
            bsize = recv(sockfd, (char*)usbd_buffer, bl, 0);

            //ack = 0x55aa55aa;
            //send_usb_req(sockfd, usb_req, (char*)&ack, 4, 0);

            usbd_buffer[bsize + 1] = 0; //string terminator
            //printf("received (%s)\n", usbd_buffer);
            hex_dump(usbd_buffer, bsize);
            //send_usb_req(sockfd, usb_req, "", 0, 0);
        }
        else
        {
            //if (_usbd_flash_type == USBD_FLASH_SPI)
            //{
            //    ack = 100;
            //}
            //else 
            if (bsize != 400) // XUSB and others
            {
                ack = bsize;
            }
            else {
                ack = 0x55aa55aa;   // DDR
            }

            //printf("direction=output, flash type: %d, ack: %08x\n", _usbd_flash_type, ack);

            send_usb_req(sockfd, usb_req, (char*)&ack, 4, 0);

