echostreams/nucemu/hw/usb/nuc970-usbd.c
        }
        usleep(500);
    }

    if ((usb_req->ep == 0x02))
    {
        printf("EP2 received \n");
        if (usb_req->direction == 0) //input
        {
            printf("direction=input\n");
            bsize = recv(sockfd, (char*)usbd_buffer, bl, 0);

            //ack = 0x55aa55aa;
            //send_usb_req(sockfd, usb_req, (char*)&ack, 4, 0);
            send_usb_req(sockfd, usb_req, "", 0, 0);

            usbd_buffer[bsize + 1] = 0; //string terminator
            //printf("received (%s)\n", usbd_buffer);
            hex_dump(usbd_buffer, bsize);
        }
        else //output
        {
            printf("direction=output\n");
            if (bsize != 0)
            {
                int i;
                for (i = 0; i < bsize; i++)//increment received char
                    usbd_buffer[i] += 1;
                hex_dump(usbd_buffer, bsize);
                send_usb_req(sockfd, usb_req, usbd_buffer, bsize, 0);
                //printf("sending (%s)\n", usbd_buffer);
                bsize = 0;
            }
            else
            {
                send_usb_req(sockfd, usb_req, "", 0, 0);
                usleep(500);
                printf("no data disponible\n");
            }
        }
    }

};

typedef struct usb_cmd
{
    uint8_t	bmRequestType;
    uint8_t	bRequest;
    uint16_t	wValue;
    uint16_t	wIndex;
    uint16_t	wLength;
}	USB_CMD_T;

void handle_unknown_control(int sockfd, StandardDeviceRequest* control_req, USBIP_RET_SUBMIT* usb_req, USBD_T* usbd)
{
    printf(">> Control Type: %d, %d\n", control_req->bmRequestType, control_req->bRequest);
    // vendor command
    USB_CMD_T _usb_cmd_pkt;
    memcpy(&_usb_cmd_pkt, control_req, sizeof(USB_CMD_T));

    if (_usb_cmd_pkt.bmRequestType == 0x40)
    {
        if (_usb_cmd_pkt.bRequest == 0xa0)
        {
            if (_usb_cmd_pkt.wValue == 0x12) {
                //Bulk_Out_Transfer_Size = _usb_cmd_pkt.wIndex;
                //printf(" >> Bulk_Out_Transfer_Size: %d\n", Bulk_Out_Transfer_Size);
                //outpw(REG_USBD_CEP_CTRL_STAT, CEP_NAK_CLEAR);	// clear nak so that sts stage is complete//lsshi
            }
            else if (_usb_cmd_pkt.wValue == 0x13) {
                // reset DMA
                //outpw(REG_USBD_DMA_CTRL_STS, 0x80);
                //outpw(REG_USBD_DMA_CTRL_STS, 0x00);
                //outpw(REG_USBD_EPA_RSP_SC, 0x01);		// flush fifo
                //outpw(REG_USBD_EPB_RSP_SC, 0x01);		// flush fifo

                //outpw(REG_USBD_CEP_CTRL_STAT, CEP_NAK_CLEAR);	// clear nak so that sts stage is complete
            }
            send_usb_req(sockfd, usb_req, "", 0, 0);
        }

        if (_usb_cmd_pkt.bRequest == 0xb0) {
            /*
            if (_usb_cmd_pkt.wValue == (USBD_BURN_TYPE + USBD_FLASH_SDRAM)) {
                _usbd_flash_type = USBD_FLASH_SDRAM;
                outpw(REG_USBD_CEP_CTRL_STAT, CEP_NAK_CLEAR);	// clear nak so that sts stage is complete//lsshi
                printf(" >> FLASH SDRAM\n");
            }
            else if (_usb_cmd_pkt.wValue == (USBD_BURN_TYPE + USBD_FLASH_NAND)) {
                _usbd_flash_type = USBD_FLASH_NAND;
                outpw(REG_USBD_CEP_CTRL_STAT, CEP_NAK_CLEAR);	// clear nak so that sts stage is complete//lsshi
                printf(" >> FLASH NAND\n");
            }
            else if (_usb_cmd_pkt.wValue == (USBD_BURN_TYPE + USBD_FLASH_NAND_RAW)) {
                _usbd_flash_type = USBD_FLASH_NAND_RAW;
                outpw(REG_USBD_CEP_CTRL_STAT, CEP_NAK_CLEAR);	// clear nak so that sts stage is complete//lsshi
                printf(" >> FLASH NAND RAW\n");
            }
            else if (_usb_cmd_pkt.wValue == (USBD_BURN_TYPE + USBD_FLASH_MMC)) {
                _usbd_flash_type = USBD_FLASH_MMC;
                outpw(REG_USBD_CEP_CTRL_STAT, CEP_NAK_CLEAR);	// clear nak so that sts stage is complete//lsshi
                printf(" >> FLASH MMC\n");
            }
            else if (_usb_cmd_pkt.wValue == (USBD_BURN_TYPE + USBD_FLASH_MMC_RAW)) {
                _usbd_flash_type = USBD_FLASH_MMC_RAW;
                outpw(REG_USBD_CEP_CTRL_STAT, CEP_NAK_CLEAR);	// clear nak so that sts stage is complete//lsshi
                printf(" >> FLASH MMC RAW\n");
            }
            else if (_usb_cmd_pkt.wValue == (USBD_BURN_TYPE + USBD_FLASH_SPI)) {
                _usbd_flash_type = USBD_FLASH_SPI;
                outpw(REG_USBD_CEP_CTRL_STAT, CEP_NAK_CLEAR);	// clear nak so that sts stage is complete//lsshi
                printf(" >> FLASH SPI\n");
            }
            else if (_usb_cmd_pkt.wValue == (USBD_BURN_TYPE + USBD_FLASH_SPI_RAW)) {
                _usbd_flash_type = USBD_FLASH_SPI_RAW;
                outpw(REG_USBD_CEP_CTRL_STAT, CEP_NAK_CLEAR);	// clear nak so that sts stage is complete//lsshi
                printf(" >> FLASH SPI RAW\n");
            }
            else if (_usb_cmd_pkt.wValue == (USBD_BURN_TYPE + USBD_MTP)) {
                _usbd_flash_type = USBD_MTP;
                outpw(REG_USBD_CEP_CTRL_STAT, CEP_NAK_CLEAR);	// clear nak so that sts stage is complete//lsshi
                printf(" >> FLASH MTP\n");
            }
            else if (_usb_cmd_pkt.wValue == (USBD_BURN_TYPE + USBD_INFO)) {
                _usbd_flash_type = USBD_INFO;
                printf(" >> FLASH USBD_INFO\n");
            }
            */
            //outpw(REG_USBD_CEP_CTRL_STAT, CEP_NAK_CLEAR);	// clear nak so that sts stage is complete//lsshi
            send_usb_req(sockfd, usb_req, "", 0, 0);
        }

        //outpw(REG_USBD_CEP_IRQ_STAT, 0x400);
        return;

    }

    /* vendor IN for ack */
    if (_usb_cmd_pkt.bmRequestType == 0xc0) {
        // clear flags
        //usbdClearAllFlags();

        //GET_VEN_Flag = 1;
        //outpw(REG_USBD_CEP_IRQ_STAT, 0x408);
        //outpw(REG_USBD_CEP_IRQ_ENB, 0x408);		//suppkt int ,status and in token
        int ack = _usb_cmd_pkt.wValue;
        send_usb_req(sockfd, usb_req, (char*)&ack, 4, 0);
        return;
    }
};

//http://www.usbmadesimple.co.uk/ums_4.htm

void handle_usb_control(int sockfd, USBIP_RET_SUBMIT* usb_req, USBD_T* usbd)
{
    int handled = 0;
    StandardDeviceRequest control_req;
#ifdef LINUX
    printf("%016llX\n", usb_req->setup);
#else
    printf("%016I64X\n", usb_req->setup);
#endif
    control_req.bmRequestType = (usb_req->setup & 0xFF00000000000000) >> 56;
    control_req.bRequest = (usb_req->setup & 0x00FF000000000000) >> 48;    
    control_req.wValue0 = (usb_req->setup & 0x0000FF0000000000) >> 40;
    control_req.wValue1 = (usb_req->setup & 0x000000FF00000000) >> 32;
    control_req.wIndex0 = (usb_req->setup & 0x00000000FF000000) >> 24;
    control_req.wIndex1 = (usb_req->setup & 0x0000000000FF0000) >> 16;
    control_req.wLength = ntohs(usb_req->setup & 0x000000000000FFFF);
    printf("  UC Request Type %u\n", control_req.bmRequestType);
    printf("  UC Request %u\n", control_req.bRequest);
    printf("  UC Value  %u[%u]\n", control_req.wValue1, control_req.wValue0);
    printf("  UC Index  %u-%u\n", control_req.wIndex1, control_req.wIndex0);
    printf("  UC Length %u\n", control_req.wLength);

    // fill setup registers
    usbd->SETUP1_0 = (control_req.bRequest << 8) | control_req.bmRequestType;
    usbd->SETUP3_2 = (control_req.wValue1 << 8) | control_req.wValue0;
    usbd->SETUP5_4 = (control_req.wIndex1 << 8) | control_req.wIndex0;
    usbd->SETUP7_6 = control_req.wLength;

    if (control_req.bmRequestType == 0x80) // Host Request
    {
        if (control_req.bRequest == 0x06) // Get Descriptor
        {
            handled = handle_get_descriptor(sockfd, &control_req, usb_req);
        }
        if (control_req.bRequest == 0x00) // Get STATUS
        {
            char data[2];
            data[0] = 0x01;
            data[1] = 0x00;
            send_usb_req(sockfd, usb_req, data, 2, 0);
            handled = 1;
            printf("GET_STATUS\n");
        }
    }

    if (control_req.bmRequestType == 0x00) // 
    {
        if (control_req.bRequest == 0x09) // Set Configuration
        {
            handled = handle_set_configuration(sockfd, &control_req, usb_req);
        }
    }

    if (control_req.bmRequestType == 0x01)
    {
        if (control_req.bRequest == 0x0B) //SET_INTERFACE  
        {
            printf("SET_INTERFACE\n");
            send_usb_req(sockfd, usb_req, "", 0, 1);
            handled = 1;
        }
    }

