echostreams/nucemu/hw/usb/nuc970-usbd.c
    if (!handled)
        handle_unknown_control(sockfd, &control_req, usb_req, usbd);
}


void handle_usb_request(int sockfd, USBIP_RET_SUBMIT* ret, int bl, USBD_T* usbd)
{
    if (ret->ep == 0)
    {
        printf("#control requests\n");
        handle_usb_control(sockfd, ret, usbd);
    }
    else
    {
        printf("#data requests\n");
        handle_data(sockfd, ret, bl, usbd);
    }
};
#endif

static void nuc970_usbd_update_interrupt(USBD_T* usbd)
{
    printf(" BUSINT %08x %08x\n", usbd->BUSINTSTS, usbd->BUSINTEN);
    printf(" CEPINT %08x %08x\n", usbd->CEPINTSTS, usbd->CEPINTEN);
    printf(" EPAINT %08x %08x\n", usbd->EP[0].EPINTSTS, usbd->EP[0].EPINTEN);
    printf(" EPBINT %08x %08x\n", usbd->EP[1].EPINTSTS, usbd->EP[1].EPINTEN);

    if (usbd->BUSINTSTS & usbd->BUSINTEN ||
        usbd->CEPINTSTS & usbd->CEPINTEN ||
        usbd->EP[0].EPINTSTS & usbd->EP[0].EPINTEN ||
        usbd->EP[1].EPINTSTS & usbd->EP[1].EPINTEN
        ) 
    {
        printf(" usbd interrupt raised...\n");
        qemu_irq_raise(usbd->irq);
    }
    else {
        printf(" usbd interrupt lowered...\n");
        qemu_irq_lower(usbd->irq);
        qemu_cond_signal(&usbd->usbip_cond);
    }
}

static void interrupt_test(USBD_T* usbd)
{
    //    BUSINT 00000000 0000000e
    //    CEPINT 00000404 00000002
    //    EPAINT 00000042 00000040
    //    EPBINT 00000003 00001010

    sleep(5);

    printf("************ INTERRUPT TEST ****************\n");

    usbd->BUSINTSTS = 0; usbd->BUSINTEN = 0xe;
    usbd->CEPINTSTS = 0x404; usbd->CEPINTEN = 0x2;
    usbd->EP[0].EPINTSTS = 0x42; usbd->EP[0].EPINTEN = 0x40;
    usbd->EP[1].EPINTSTS = 0x3; usbd->EP[1].EPINTEN = 0x1010;

    qemu_mutex_lock_iothread();
    nuc970_usbd_update_interrupt(usbd);
    qemu_mutex_unlock_iothread();
    
    g_usleep(G_USEC_PER_SEC * 0.1);

    printf("**************** TEST 1 ********************\n");
    //EPAINT 0000004e 00000040
    usbd->EP[0].EPINTSTS = 0x4e; usbd->EP[0].EPINTEN = 0x40;

    qemu_mutex_lock_iothread();
    nuc970_usbd_update_interrupt(usbd);
    qemu_mutex_unlock_iothread();

    printf("*************** TEST END *******************\n");
}

static void* nuc970_usbip_thread_run(void* opaque)
{
    USBD_T* usbd = (USBD_T*)opaque;
#if 0
    interrupt_test(usbd);
    return NULL;
#endif
    usbip_cfg_t* cfg = &usbd->usbip_cfg;
    struct sockaddr_in serv, cli;
    int listenfd, sockfd, nb;
#ifdef __linux__
    unsigned int clilen;
#else
    int clilen;
#endif
    unsigned char attached;

#ifndef __linux__
    WSAStartup(wVersionRequested, &wsaData);
    if (wsaData.wVersion != wVersionRequested)
    {
        fprintf(stderr, "\n Wrong version\n");
        exit(-1);
    }

#endif

    if ((listenfd = socket(PF_INET, SOCK_STREAM, 0)) < 0)
    {
        printf("socket error : %s \n", strerror(errno));
        exit(1);
    };

    int reuse = 1;
    if (setsockopt(listenfd, SOL_SOCKET, SO_REUSEADDR, (const char*)&reuse, sizeof(reuse)) < 0)
        perror("setsockopt(SO_REUSEADDR) failed");

    memset(&serv, 0, sizeof(serv));
    serv.sin_family = AF_INET;
    serv.sin_addr.s_addr = htonl(INADDR_ANY);
    serv.sin_port = htons(/*cfg->port*/TCP_SERV_PORT);

    if (bind(listenfd, (sockaddr*)&serv, sizeof(serv)) < 0)
    {
        printf("bind error : %s \n", strerror(errno));
        exit(1);
    };

    if (listen(listenfd, SOMAXCONN) < 0)
    {
        printf("listen error : %s \n", strerror(errno));
        exit(1);
    };

    for (;;)
    {
        clilen = sizeof(cli);
        if (
            (sockfd =
                accept(listenfd, (sockaddr*)&cli, &clilen)) < 0)
        {
            printf("accept error : %s \n", strerror(errno));
            exit(1);
        };
        printf("Connection address:%s\n", inet_ntoa(cli.sin_addr));
        attached = 0;
        cfg->_private_fd = sockfd;
        while (1)
        {
            if (!attached)
            {
                OP_REQ_DEVLIST req;
                if ((nb = recv(sockfd, (char*)&req, sizeof(OP_REQ_DEVLIST), 0)) != sizeof(OP_REQ_DEVLIST))
                {
                    //printf ("receive error : %s \n", strerror (errno));
                    break;
                };
#ifdef _DEBUG
                print_recv((char*)&req, sizeof(OP_REQ_DEVLIST), "OP_REQ_DEVLIST");
#endif
                req.command = ntohs(req.command);
                printf("Header Packet\n");
                printf("command: 0x%02X\n", req.command);
                if (req.command == 0x8005)
                {
                    OP_REP_DEVLIST list;
                    printf("list of devices\n");

                    handle_device_list(&_dev_dsc, &list);

                    if (send(sockfd, (char*)&list.header, sizeof(OP_REP_DEVLIST_HEADER), 0) != sizeof(OP_REP_DEVLIST_HEADER))
                    {
                        printf("send error : %s \n", strerror(errno));
                        break;
                    };
                    if (send(sockfd, (char*)&list.device, sizeof(OP_REP_DEVLIST_DEVICE), 0) != sizeof(OP_REP_DEVLIST_DEVICE))
                    {
                        printf("send error : %s \n", strerror(errno));
                        break;
                    };
                    if (send(sockfd, (char*)list.interfaces, sizeof(OP_REP_DEVLIST_INTERFACE) * list.device.bNumInterfaces, 0) != sizeof(OP_REP_DEVLIST_INTERFACE) * list.device.bNumInterfaces)
                    {
                        printf("send error : %s \n", strerror(errno));
                        break;
                    };
                    free(list.interfaces);
                }
                else if (req.command == 0x8003)
                {
                    char busid[32];
                    OP_REP_IMPORT rep;
                    printf("attach device\n");
                    if ((nb = recv(sockfd, busid, 32, 0)) != 32)
                    {
                        printf("receive error : %s \n", strerror(errno));
                        break;
                    };
#ifdef _DEBUG
                    print_recv(busid, 32, "Busid");
#endif
                    
