echostreams/nucemu/hw/usb/nuc970-usbd.c
                    usbd_handle_attach(/*&_dev_dsc*/NULL, &rep, usbd);
                    int ret = send(sockfd, (char*)&rep, sizeof(OP_REP_IMPORT), 0);
                    printf("handle attach send: %d\n", ret);
                    if ( ret != sizeof(OP_REP_IMPORT))
                    {
                        printf("send error : %s \n", strerror(errno));
                        break;
                    };
                    printf("attached\n");
                    attached = 1;
                }
            }
            else
            {
                printf("------------------------------------------------\n");
                printf("handles requests\n");
                USBIP_CMD_SUBMIT cmd;
                USBIP_RET_SUBMIT usb_req;
                if ((nb = recv(sockfd, (char*)&cmd, sizeof(USBIP_CMD_SUBMIT), 0)) != sizeof(USBIP_CMD_SUBMIT))
                {
                    printf("receive error : %s, nb: %d \n", strerror(errno), nb);
                    break;

                };
#ifdef _DEBUG
                print_recv((char*)&cmd, sizeof(USBIP_CMD_SUBMIT), "USBIP_CMD_SUBMIT");
#endif
                unpack((int*)&cmd, sizeof(USBIP_CMD_SUBMIT));
                printf("usbip cmd %u\n", cmd.command);
                printf("usbip seqnum %u\n", cmd.seqnum);
                printf("usbip devid %u\n", cmd.devid);
                printf("usbip direction %u\n", cmd.direction);
                printf("usbip ep %u\n", cmd.ep);
                printf("usbip flags 0x%08x\n", cmd.transfer_flags);
                printf("usbip number of packets %u\n", cmd.number_of_packets);
                printf("usbip interval %u\n", cmd.interval);
                //  printf("usbip setup %"PRI"\n",cmd.setup);
                printf("usbip buffer lenght  %u\n", cmd.transfer_buffer_length);
                printf("usbip start frame %u\n", cmd.start_frame);
                usb_req.command = 0;
                usb_req.seqnum = cmd.seqnum;
                usb_req.devid = cmd.devid;
                usb_req.direction = cmd.direction;
                usb_req.ep = cmd.ep;
                usb_req.status = 0;
                usb_req.actual_length = 0;
                usb_req.start_frame = 0;
                usb_req.number_of_packets = 0;
                usb_req.error_count = 0;
                usb_req.setup = cmd.setup;

                if (cmd.command == 1)
                {
                    printf("usb_req ep %d\n", usb_req.ep);
                    USBIPServerClass* s = USBIP_SERVER_GET_CLASS(cfg->self);
                    s->usbip_handle_packet(cfg->self, &cmd, &usb_req);
                    //handle_usb_request(sockfd, &usb_req, cmd.transfer_buffer_length, usbd);
                }              

                if (cmd.command == 2) //unlink urb
                {
                    printf("####################### Unlink URB %u  (not working!!!)\n", cmd.transfer_flags);
                    //FIXME
                      /*
                       USBIP_RET_UNLINK ret;
                       printf("####################### Unlink URB %u\n",cmd.transfer_flags);
                       ret.command=htonl(0x04);
                       ret.devid=htonl(cmd.devid);
                       ret.direction=htonl(cmd.direction);
                       ret.ep=htonl(cmd.ep);
                       ret.seqnum=htonl(cmd.seqnum);
                       ret.status=htonl(1);

                       if (send (sockfd, (char *)&ret, sizeof(USBIP_RET_UNLINK), 0) != sizeof(USBIP_RET_UNLINK))
                       {
                         printf ("send error : %s \n", strerror (errno));
                         exit(-1);
                       };
                      */
                }

                if (cmd.command > 2)
                {
                    printf("Unknown USBIP cmd!\n");
                    close(sockfd);
                    cfg->_private_fd = 0;
#ifndef __linux__
                    WSACleanup();
#endif
                    return NULL;
                };

            }
        }
        close(sockfd);
        cfg->_private_fd = 0;
    };
#ifndef __linux__
    WSACleanup();
#endif
}

uint32_t read_gintsts(USBD_T* s)
{
    uint32_t r = 0;
    int i;
    if (s->BUSINTSTS & s->BUSINTEN)
        r |= (1 << 0);
    if (s->CEPINTSTS & s->CEPINTEN)
        r |= (1 << 1);
    for (i = 0; i < 12; i++) {
        if (s->EP[i].EPINTSTS & s->EP[i].EPINTEN) {
            r |= (1 << (2 + i));
        }
    }
    return r;
}

static uint64_t nuc970_usbd_read(void* opaque, hwaddr offset, unsigned size)
{
    USBD_T* s = (USBD_T*)opaque;
    uint32_t r = 0;

    switch (offset) {
    case 0x00:
        r = read_gintsts(s); break;
    case 0x08:
        r = s->GINTEN; break;
    case 0x10:
        r = s->BUSINTSTS; break;
    case 0x14:
        r = s->BUSINTEN; break;
    case 0x18:
        r = s->OPER; break;
    case 0x1c:
        r = s->FRAMECNT; break;
    case 0x20:
        r = s->FADDR; break;
    case 0x24:
        r = s->TEST; break;
    case 0x28 ... 0x2b:        
        if (size == 4) {
            r = *(uint32_t*)&s->usbip_cep_buffer[s->usbip_cep_index];
            s->usbip_cep_index += 4;
        }
        else if (size == 1) {
            r = s->usbip_cep_buffer[s->usbip_cep_index++];
        }
        break;
    case 0x2c:
        r = s->CEPCTL; break;
    case 0x30:
        r = s->CEPINTEN; break;
    case 0x34:
        r = s->CEPINTSTS; break;
    case 0x38:
        r = s->CEPTXCNT; break;
    case 0x3c:
        r = s->CEPRXCNT; break;
    case 0x40:
        r = s->CEPDATCNT; break;
    case 0x44:
        r = s->SETUP1_0; break;
    case 0x48:
        r = s->SETUP3_2; break;
    case 0x4c:
        r = s->SETUP5_4; break;
    case 0x50:
        r = s->SETUP7_6; break;
    case 0x54:
        r = s->CEPBUFSTART; break;
    case 0x58:
        r = s->CEPBUFEND; break;
    case 0x5c:
        r = s->DMACTL; break;
    case 0x60:
        r = s->DMACNT; break;
    case 0x64 ... 0x240:
        {
            int epidx = (offset - 0x64) / 40;
            int regidx = ((offset - 0x64) % 40) / 4;
            //printf(" epidx: %d\n", epidx);
            switch (regidx) {
            case 0: // DAT                
                if ((s->EP[epidx].EPCFG >> 3) & 0x01)   // IN (Host IN from Device)
                {
                    // do nothing
                }
                else // OUT (Host OUT to Device)
                {
                    qemu_mutex_lock(&s->usbip_rx_mtx);
                    r = s->usbip_rx_buffer[s->usbip_rx_index++];
                    qemu_mutex_unlock(&s->usbip_rx_mtx);
                }
                break;
            case 1: // INTSTS
                r = s->EP[epidx].EPINTSTS;
                break;
            case 2: // INTEN
                r= s->EP[epidx].EPINTEN;
                break;
            case 3: // DATCNT
                r = s->EP[epidx].EPDATCNT;
                break;
            case 4: // RSPCTL
                r = s->EP[epidx].EPRSPCTL;
                break;
            case 5: // MPS
                r = s->EP[epidx].EPMPS;
                break;
            case 6: // TXCNT
                r = s->EP[epidx].EPTXCNT;
                break;
            case 7: // CFG
                r = s->EP[epidx].EPCFG;
                break;
            case 8: // BUFSTART
                r = s->EP[epidx].EPBUFSTART;
                break;
            case 9: // BUFEND
                r = s->EP[epidx].EPBUFEND;
                break;
            }
        }
        break;
    case 0x700:
        r = s->DMAADDR;
        break;
    default:
        r = 0xffffffff;
        break;
    }
    //fprintf(stderr, "usbd_r (offset=%03lx/%d, value=%08x)\n", offset, size, r);
    return r;
}

static void nuc970_usbd_write(void* opaque, hwaddr offset, uint64_t value, unsigned size)
{
    USBD_T* s = (USBD_T*)opaque;
    switch (offset) {
    case 0x08:
        s->GINTEN = value;
        break;
    case 0x10:        
        if (value & 0x17f) { // clear [8,6:0]
            s->BUSINTSTS &= ~(value & 0x17f);
            nuc970_usbd_update_interrupt(s);
        }
        break;
    case 0x14:
        s->BUSINTEN = value; 
        nuc970_usbd_update_interrupt(s);
        break;
    case 0x18:
        s->OPER = value & ~(1 << 0); break; // RESUMEEN bit is self-clearing
    case 0x1c:
        s->FRAMECNT = value; break;
    case 0x20:
        s->FADDR = value & 0x7f; break;
    case 0x24:
        s->TEST = value; break;
    case 0x28 ... 0x2b:
        if (size == 4) {
            s->cep.CEPDAT = value;
            s->usbip_cep_buffer[s->usbip_cep_level++] = ((value >> 0) & 0xff);
            s->usbip_cep_buffer[s->usbip_cep_level++] = ((value >> 8) & 0xff);
            s->usbip_cep_buffer[s->usbip_cep_level++] = ((value >> 16) & 0xff);
            s->usbip_cep_buffer[s->usbip_cep_level++] = ((value >> 24) & 0xff);
        }
        else if (size == 1) {
            s->cep.CEPDAT &= ~(0xff << ((offset % 4) * 8));
            s->cep.CEPDAT |= (value & 0xff) << ((offset % 4) * 8);
            s->usbip_cep_buffer[s->usbip_cep_level++] = value & 0xff;
        }
        break;        
    case 0x2c:
        s->CEPCTL = value;
        break;
    case 0x30:
        s->CEPINTEN = value;
        nuc970_usbd_update_interrupt(s);
        break;
    case 0x34:        
        if (value & 0x1fff) { // clear [12:0]
            s->CEPINTSTS &= ~(value & 0x1fff);
            nuc970_usbd_update_interrupt(s);
        }
        break;
    case 0x38:  // In-transfer Data Count
        {
            s->CEPTXCNT = value;
            qemu_cond_signal(&s->usip_reply_ready);
        }
        break;
    // 0x3c/40/44/48/4c/50 readonly
    case 0x54:
        s->CEPBUFSTART = value; break;
    case 0x58:
        s->CEPBUFEND = value; break;
    case 0x5c:        
        s->DMACTL = value & ~(1 << 5);  // DMAEN write only???        
        if (value & (1 << 5)) { // DMAEN
            if (value & (1 << 4)) { // DMA read (write to USB buffer)
                printf("DMARD %d %08x...\n", s->DMACNT, s->DMAADDR);
                while (get_tx_level(s))
                    g_usleep(500);
                dma_memory_read(&address_space_memory, s->DMAADDR, s->usbip_tx_buffer,
                    s->DMACNT, MEMTXATTRS_UNSPECIFIED);
                //for (int k = 0; k < s->DMACNT; k++)
                //    printf(" \033[0;32m%02x\033[0m", s->usbip_tx_buffer[k]);
                //printf("\n");
                //if (s->DMACNT) {
                //    qemu_cond_signal(&s->usip_reply_ready);
                //}
                set_tx_level(s, s->DMACNT);
                s->EP[0].EPINTSTS &= ~(USBD_EPINTSTS_BUFEMPTYIF_Msk); // not empty
            }
            else {  // DMA write (read from USB buffer)
                
