echostreams/nucemu/hw/usb/nuc970-usbd.c
                printf("DMAWR %d %08x, EP: %d...\n", s->DMACNT, s->DMAADDR, s->DMACTL & 0xf);
                
                while (!get_rx_level(s)) {  // wait for rx buffer ready
                    g_usleep(500);
                }
                
                dma_memory_write(&address_space_memory, s->DMAADDR, s->usbip_rx_buffer,
                    s->DMACNT, MEMTXATTRS_UNSPECIFIED);
                for (int k = 0; k < s->DMACNT; k++)
                    printf(" \033[0;33m%02x\033[0m", s->usbip_rx_buffer[k]);
                printf("\n");
                set_rx_level(s, 0); // empty rx buffer
                
            }
            s->BUSINTSTS |= (1 << USBD_BUSINTEN_DMADONEIEN_Pos);    // DMADONEIF
            nuc970_usbd_update_interrupt(s);
        }
        if (value & (1 << 7)) {
            s->DMACNT = 0;
            s->DMACTL = 0x80;
            s->DMACTL = 0x00;
        }        
        break;
    case 0x60:
        s->DMACNT = value; break;
    case 0x64 ... 0x240:
        {
            int epidx = (offset - 0x64) / 40;
            int regidx = ((offset - 0x64) % 40) / 4;
            //printf(" epidx: %d\n", epidx);
            switch (regidx) {
            case 0: // DAT only word or byte access are supported
                if (size == 4) 
                    s->EP[epidx].ep.EPDAT = value;
                else
                    s->EP[epidx].ep.EPDAT_BYTE = value & 0xff;

                if ((s->EP[epidx].EPCFG >> 3) & 0x01)   // IN (Host IN from Device)
                {
                    //qemu_mutex_lock(&s->usbip_tx_mtx);
                    s->usbip_tx_buffer[s->usbip_tx_level++] = s->EP[epidx].ep.EPDAT_BYTE;
                    s->EP[0].EPINTSTS &= ~(USBD_EPINTSTS_BUFEMPTYIF_Msk); // not empty
                    //qemu_mutex_unlock(&s->usbip_tx_mtx);
                    printf(" *** writing tx %02x, level %d\n", s->EP[epidx].ep.EPDAT_BYTE, s->usbip_tx_level);
                }
                else // OUT (Host OUT to Device)
                {
                    // do nothing
                }
                break;
            case 1: // INTSTS                
                if (value & 0x1ffc) {
                    s->EP[epidx].EPINTSTS &= ~(value & 0x1ffc);
                    nuc970_usbd_update_interrupt(s);
                }
                break;
            case 2: // INTEN
                s->EP[epidx].EPINTEN = value;
                nuc970_usbd_update_interrupt(s);
                break;
            case 3: // DATCNT
                s->EP[epidx].EPDATCNT = value;
                break;
            case 4: // RSPCTL
                s->EP[epidx].EPRSPCTL = value;
                break;
            case 5: // MPS
                s->EP[epidx].EPMPS = value;
                break;
            case 6: // TXCNT
                s->EP[epidx].EPTXCNT = value;
                break;
            case 7: // CFG
                s->EP[epidx].EPCFG = value;
                break;
            case 8: // BUFSTART
                s->EP[epidx].EPBUFSTART = value;
                break;
            case 9: // BUFEND
                s->EP[epidx].EPBUFEND = value;
                break;
            }
        }        
        break;
    case 0x700:
        s->DMAADDR = value;
        break;
         
    default:
        fprintf(stderr, "usbd_w (offset=%lx)\n", offset);
        break;
    }
    if (offset != 0x74)
        fprintf(stderr, "usbd_w (offset=%03lx/%d, value=%08lx)\n", offset, size, value);
}

static const MemoryRegionOps nuc970_usbd_ops = {
    .read = nuc970_usbd_read,
    .write = nuc970_usbd_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,   // allow byte access
        .max_access_size = 4,
    },
};

static void nuc970_usbd_reset(DeviceState* dev)
{
    USBD_T* s = NUC970_USBD(dev);
    unsigned int i;
    s->GINTEN = 1;
    s->BUSINTSTS = 0;
    s->BUSINTEN = 0x00000040;
    s->OPER = 0x00000002;   // enable High-speed
    s->FRAMECNT = 0;
    s->FADDR = 0;
    s->TEST = 0;
    s->cep.CEPDAT = 0;
    s->CEPCTL = 0;
    s->CEPINTEN = 0;
    s->CEPINTSTS = 0x00001800;
    s->CEPTXCNT = s->CEPRXCNT = s->CEPDATCNT = 0;
    s->DMACNT = 0;
    s->DMACTL = 0;
    s->EP[0].EPINTSTS = 0x00000003;
    s->EP[0].EPINTEN = USBD_EPINTEN_BUFEMPTYIEN_Msk;
    s->EP[0].EPCFG = 0x00000012;
    s->EP[0].EPDATCNT = 0;
    s->EP[1].EPINTSTS = 0x00000003;
    s->EP[1].EPINTEN = USBD_EPINTEN_BUFEMPTYIEN_Msk;
    s->EP[1].EPCFG = 0x00000022;
    s->EP[1].EPDATCNT = 0;

    s->usbip_cep_level = 0;
    s->usbip_cep_index = 0;    
    s->usbip_rx_level = 0;
    s->usbip_rx_index = 0;
    s->usbip_tx_level = 0;
    s->usbip_tx_index = 0;
    qemu_irq_lower(s->irq);

    s->BUSINTSTS |= USBD_BUSINTSTS_RSTIF_Msk;
}

static void nuc970_usbd_init(Object* obj)
{
    USBD_T* s = NUC970_USBD(obj);
    SysBusDevice* sbd = SYS_BUS_DEVICE(obj);

    memory_region_init_io(&s->iomem, OBJECT(s), &nuc970_usbd_ops, s, "nuc970-usbd", 0x1000);
    sysbus_init_mmio(sbd, &s->iomem);
    sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->irq);

    s->usbip_cfg.self = USBIP_SERVER(s);
}

static void nuc970_usbd_realize(DeviceState* dev, Error** errp)
{
    USBD_T* s = NUC970_USBD(dev);
    qemu_mutex_init(&s->usbip_mutex);
    qemu_cond_init(&s->usbip_cond);

    qemu_mutex_init(&s->usbip_rx_mtx);
    qemu_mutex_init(&s->usbip_tx_mtx);
    qemu_cond_init(&s->usip_reply_ready);

    qemu_thread_create(&s->usbip_thread, "usbip", 
        nuc970_usbip_thread_run, s, QEMU_THREAD_JOINABLE);
}

typedef union {
    uint32_t raw;
    struct {
        uint32_t CHNUM : 4;
        uint32_t BCNT : 11;
        uint32_t DPID : 2;
        uint32_t PKTSTS : 4;
        uint32_t : 11;
    } HOST QEMU_PACKED;
    struct {
        uint32_t EPNUM : 4;
        uint32_t BCNT : 11;
        uint32_t DPID : 2;
        uint32_t PKTSTS : 4;
        uint32_t FRMNUM : 4;
        uint32_t : 6;
        uint32_t INCOMPLETE : 1; // NB- this isn't used by the device, rather by us to handle multi-packet IN transfers.
    } DEV QEMU_PACKED;
} buffer_header_t;

enum {
    BUFFER_PKTSTS_GNAK = 1U,
    BUFFER_PKTSTS_OUT = 2U,
    BUFFER_PKTSTS_OUTCPLT = 3U,
    BUFFER_PKTSTS_SETUPCPLT = 4U,
    BUFFER_PKTSTS_SETUP = 6U
};

static void nuc970_usbip_handle_control(USBIPIF* self, USBIP_CMD_SUBMIT* cmd, USBIP_RET_SUBMIT* usb_req)
{
    printf("Handle control packet: Setup: %llx\n", cmd->setup);

    USBD_T* s = NUC970_USBD(self);
    unsigned char payload[512];
    uint8_t payload_size = 0;
    bool has_setup = true;
    
    if (cmd->transfer_buffer_length != 0 && cmd->direction == 0)
    {
        if (usbip_read_payload(&s->usbip_cfg, payload, cmd->transfer_buffer_length))
        {
            payload_size = cmd->transfer_buffer_length;
        }
        else
        {
            printf("XFER BUF LENGTH ERR\n");
        }
    }

    if (has_setup)
    {
        s->SETUP1_0 = ntohs((usb_req->setup & 0xFFFF000000000000) >> 48);
        s->SETUP3_2 = ntohs((usb_req->setup & 0x0000FFFF00000000) >> 32);
        s->SETUP5_4 = ntohs((usb_req->setup & 0x00000000FFFF0000) >> 16);
        s->SETUP7_6 = ntohs((usb_req->setup & 0x000000000000FFFF) >> 0);
        s->CEPINTSTS |= USBD_CEPINTSTS_SETUPPKIF_Msk;
        if (payload_size) {
            memcpy(s->usbip_cep_buffer, payload, payload_size);
            s->usbip_cep_level = payload_size;
            s->usbip_cep_index = 0;
            s->CEPINTSTS |= USBD_CEPINTSTS_RXPKIF_Msk;
        }
        qemu_mutex_lock_iothread();
        nuc970_usbd_update_interrupt(s);
        qemu_mutex_unlock_iothread();       
    }

