echostreams/nucemu/hw/usb/nuc970-usbd.c
    /*
    printf(" usbip cond wait...\n");
    qemu_mutex_lock(&s->usbip_mutex);
    qemu_cond_wait(&s->usbip_cond, &s->usbip_mutex);
    qemu_mutex_unlock(&s->usbip_mutex);
    printf(" usbip cond ready...\n");
    */
    g_usleep(G_USEC_PER_SEC * 0.1);
   
    printf(" >>>> setup %d >>>>>>> \n", has_setup);
    
    qemu_mutex_lock(&s->usbip_rx_mtx);
    printf(" ==== payload %d ===== \n", payload_size);

    if (payload_size)
    {
        for (int j = 0; j < payload_size; j++)
            printf(" %02x", payload[j]);
        printf("\n");
    }
    qemu_mutex_unlock(&s->usbip_rx_mtx);

    if (usb_req->direction) {
        s->CEPINTSTS |= USBD_CEPINTSTS_INTKIF_Msk;
        qemu_mutex_lock_iothread();
        nuc970_usbd_update_interrupt(s);
        qemu_mutex_unlock_iothread();

        qemu_mutex_lock(&s->usbip_tx_mtx);
        //s->usbip_tx_wlen = cmd->transfer_buffer_length;
        printf(" wait for reply ready, transfer_buffer_length: %d\n", cmd->transfer_buffer_length);

        // if (reply_required) 
        // {
        qemu_cond_wait(&s->usip_reply_ready, &s->usbip_tx_mtx);
        // }
        if (cmd->transfer_buffer_length > 0x40 && 
            cmd->transfer_buffer_length != 0xff) {
            printf(" reply ready 1...\n");
            
            g_usleep(3000);

            while (s->usbip_cep_level < cmd->transfer_buffer_length) {
                s->CEPINTSTS |= USBD_CEPINTSTS_TXPKIF_Msk;
                qemu_mutex_lock_iothread();
                nuc970_usbd_update_interrupt(s);
                qemu_mutex_unlock_iothread();

                g_usleep(3000);

                s->CEPINTSTS |= USBD_CEPINTSTS_INTKIF_Msk;
                qemu_mutex_lock_iothread();
                nuc970_usbd_update_interrupt(s);
                qemu_mutex_unlock_iothread();

                qemu_cond_wait(&s->usip_reply_ready, &s->usbip_tx_mtx);
            }
        }
        printf(" reply ready 2...\n");
        //header.raw = s->usbip_tx_buffer[0];
        usbip_send_reply(&s->usbip_cfg, usb_req, (char*)&s->usbip_cep_buffer[0],
            //header.DEV.BCNT,
            s->usbip_cep_level,
            0);
        // Wipe data from buffer.
        s->usbip_cep_level = 0;
        s->usbip_cep_index = 0;
        qemu_mutex_unlock(&s->usbip_tx_mtx);

        s->CEPINTSTS |= USBD_CEPINTSTS_TXPKIF_Msk;
        qemu_mutex_lock_iothread();
        nuc970_usbd_update_interrupt(s);
        qemu_mutex_unlock_iothread();
        g_usleep(10000);
    }
    else {  // usb_req->direction == 0
        
        /*
        s->CEPINTSTS |= USBD_CEPINTSTS_OUTTKIF_Msk;
        qemu_mutex_lock_iothread();
        nuc970_usbd_update_interrupt(s);
        qemu_mutex_unlock_iothread();
        g_usleep(1000);
        */
        if (payload_size) {
            s->CEPINTSTS |= USBD_CEPINTSTS_RXPKIF_Msk;
            qemu_mutex_lock_iothread();
            nuc970_usbd_update_interrupt(s);
            qemu_mutex_unlock_iothread();
            g_usleep(1000);
        }

        //qemu_mutex_lock(&s->usbip_tx_mtx);
        usbip_send_reply(&s->usbip_cfg, usb_req, NULL, cmd->transfer_buffer_length, 0);
        //qemu_mutex_unlock(&s->usbip_tx_mtx);

        // Wipe data from buffer.
        s->EP[0].EPINTSTS |= USBD_EPINTSTS_BUFEMPTYIF_Msk;
        s->usbip_cep_level = 0;
        s->usbip_cep_index = 0;
    }

    s->CEPINTSTS |= USBD_CEPINTSTS_STSDONEIF_Msk;
    qemu_mutex_lock_iothread();
    nuc970_usbd_update_interrupt(s);
    qemu_mutex_unlock_iothread();
    usleep(10000);
}

static void nuc970_usbip_handle_data(USBIPIF* self, USBIP_CMD_SUBMIT* cmd, USBIP_RET_SUBMIT* usb_req, int bl)
{
    /* EPA ==> Bulk IN endpoint, address 1 */
    /* EPB ==> Bulk OUT endpoint, address 2 */

    USBD_T* s = NUC970_USBD(self);
    int ep = usb_req->ep;

    if (cmd->direction == 0) // HOST OUT
    {   
        /* 
        // Don't send interrupt, the client is waiting for data...
        s->EP[usb_req->ep - 1].EPINTSTS |= USBD_EPINTSTS_OUTTKIF_Msk;
        qemu_mutex_lock_iothread();
        nuc970_usbd_update_interrupt(s);
        qemu_mutex_unlock_iothread();
        g_usleep(G_USEC_PER_SEC * 0.1);
        */
        int chunk_size = min(cmd->transfer_buffer_length, 4096);
        int chunk_cnt = cmd->transfer_buffer_length / chunk_size;
        int i; 
        for (i = 0; i < chunk_cnt; i++) 
        {

            if (usbip_read_payload(&s->usbip_cfg, s->usbip_rx_buffer, chunk_size))
            {
                printf(" Host OUT: \n");
                for (int j = 0; j < chunk_size; j++)
                    printf(" %02x", (unsigned char)s->usbip_rx_buffer[j]);
                printf("\n");

                set_rx_level(s, chunk_size);
                s->usbip_rx_index = 0;  // reset index                

                s->EP[ep - 1].EPINTSTS |= USBD_EPINTSTS_RXPKIF_Msk;
                s->EP[ep - 1].EPDATCNT = chunk_size;

                qemu_mutex_lock_iothread();
                nuc970_usbd_update_interrupt(s);
                qemu_mutex_unlock_iothread();
                g_usleep(G_USEC_PER_SEC * 0.05);

                //s->EP[usb_req->ep - 1].EPINTSTS |= USBD_EPINTSTS_TXPKIF_Msk;
                //qemu_mutex_lock_iothread();
                //nuc970_usbd_update_interrupt(s);
                //qemu_mutex_unlock_iothread();
                //g_usleep(G_USEC_PER_SEC * 0.1);
            }
            else
            {
                printf("XFER BUF LENGTH ERR\n");
            }
        }

        qemu_mutex_lock(&s->usbip_tx_mtx);

        usb_req->command = 0x3;
        usb_req->status = 0;
        usb_req->actual_length = cmd->transfer_buffer_length;
        usb_req->start_frame = 0x0;
        usb_req->number_of_packets = 0x0;

        usb_req->setup = 0x0;
        usb_req->devid = 0x0;
        usb_req->direction = cmd->direction;
        usb_req->ep = cmd->ep;
        usb_req->error_count = 0x0;
        pack((int*)usb_req, sizeof(USBIP_RET_SUBMIT));

        if (send(s->usbip_cfg._private_fd, (char*)usb_req, sizeof(USBIP_RET_SUBMIT), 0) !=
            sizeof(USBIP_RET_SUBMIT))
        {
            printf("send error : %s \n", strerror(errno));
            exit(-1);
        };

        qemu_mutex_unlock(&s->usbip_tx_mtx);
    }
    else {  // HOST IN       
        

        if (cmd->ep == 3)   // Interrupt
        {
            // enable EPA INTK
            s->EP[0].EPINTEN |= USBD_EPINTEN_INTKIEN_Msk;
            usbip_send_reply(&s->usbip_cfg, usb_req, "", 0, 0);
        }
        else {

            s->EP[usb_req->ep - 1].EPINTSTS |= USBD_EPINTSTS_INTKIF_Msk;
            qemu_mutex_lock_iothread();
            nuc970_usbd_update_interrupt(s);
            qemu_mutex_unlock_iothread();

            g_usleep(G_USEC_PER_SEC * 0.5);

            if (cmd->transfer_buffer_length <= 4096) {
                qemu_mutex_lock(&s->usbip_tx_mtx);
                printf(" reply %d, buffer size: %d...\n", cmd->transfer_buffer_length, s->usbip_tx_level);
                usbip_send_reply(&s->usbip_cfg, usb_req, s->usbip_tx_buffer,
                    s->usbip_tx_level,
                    0);
                s->usbip_tx_level = 0;  // trigger client to write data...
                qemu_mutex_unlock(&s->usbip_tx_mtx);
            }
            else {                
                uint8_t* buf = malloc(cmd->transfer_buffer_length);
                int loop = cmd->transfer_buffer_length / 4096;
                int i;
                for (i = 0; i < loop; i++) {
                    memcpy(buf + (i * 4096), s->usbip_tx_buffer, 4096);
                    set_tx_level(s, 0); // tigger client to write again.
                    s->EP[0].EPINTSTS |= USBD_EPINTSTS_BUFEMPTYIF_Msk;  // empty
                    printf(">>>>>>\n");
                    while (!get_tx_level(s)) {
                        g_usleep(500);
                    }
                    printf(" bulk in loop %d...\n", i);
                }
                usbip_send_reply(&s->usbip_cfg, usb_req, buf, cmd->transfer_buffer_length, 0);
                
                free(buf);
            }

            s->EP[0].EPINTSTS |= USBD_EPINTSTS_BUFEMPTYIF_Msk;  // empty

