echostreams/nucemu/hw/usb/nuc970-usbd.c
            s->EP[ep - 1].EPINTSTS |= USBD_EPINTSTS_SHORTTXIF_Msk;
            s->EP[ep - 1].EPINTSTS |= USBD_EPINTSTS_TXPKIF_Msk;
            qemu_mutex_lock_iothread();
            nuc970_usbd_update_interrupt(s);
            qemu_mutex_unlock_iothread();

            g_usleep(G_USEC_PER_SEC * 0.1);
        }
    }

    //s->CEPINTSTS |= USBD_CEPINTSTS_STSDONEIF_Msk;
    //qemu_mutex_lock_iothread();
    //nuc970_usbd_update_interrupt(s);
    //qemu_mutex_unlock_iothread();
    //usleep(1000);
}

static void nuc970_usbip_handle_packet(USBIPIF* self, USBIP_CMD_SUBMIT* cmd, USBIP_RET_SUBMIT* usb_req)
{
    printf("Handle packet called: Setup: %llx, ep: %d, dir: %d\n", cmd->setup, cmd->ep, cmd->direction);

    if (cmd->ep == 0) {
        nuc970_usbip_handle_control(self, cmd, usb_req);
    }
    else {
        nuc970_usbip_handle_data(self, cmd, usb_req, cmd->transfer_buffer_length);
    }
}

static void nuc970_usbd_class_init(ObjectClass* klass, void* data)
{
    DeviceClass* dc = DEVICE_CLASS(klass);
    dc->realize = nuc970_usbd_realize;
    dc->reset = nuc970_usbd_reset;
    set_bit(DEVICE_CATEGORY_USB, dc->categories);
    USBIPServerClass* sc = USBIP_SERVER_CLASS(dc);
    sc->usbip_handle_packet = nuc970_usbip_handle_packet;
}

static const TypeInfo nuc970_usbd_info = {
 .name = TYPE_NUC970_USBD,
 .parent = TYPE_SYS_BUS_DEVICE,
 .instance_size = sizeof(USBD_T),
 .class_init = nuc970_usbd_class_init,
 .instance_init = nuc970_usbd_init,
 .interfaces = (InterfaceInfo[]) {
    { TYPE_USBIP_SERVER },
    { }
 }
};

static void nuc970_usbd_register_types(void)
{
    type_register_static(&nuc970_usbd_info);
}

type_init(nuc970_usbd_register_types)
